#зміна
#Розв'язання задачі Заміна. Спосіб 1

#Створення функції
def replace():
    for item in a:       #Перебір елементів в списку а
        if item < 0:     #Якщо елемент <0,
            b.append(-1) #то в список b додати -1.
        elif item > 0:   #Якщо елемент >0,
            b.append(1)  #то в список b додати 1.
        else:            #Інакше (=0) 
            b.append(0)  #в список b додати 0.
               
    return (b)           #Повернути список b

from random import randint #Імпорт функції randint з модуля random
a = []                     #Створення пустого списку а
b = []                     #Створення пустого списку b
for i in range (10):       #За допомогою циклу for заповнюємо список 10-ма
    a.append(randint(-20,20)) #випадковавими числами від -20 до 20

print(a)                 #Вивести список а
print(replace())         #Вивести значення функції replace (cписок b)
